%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
						%求最最小值和次小值 
A = randi([0 1000],[5,6])  % 随机生成实验数据
%A=[500,600,400;30,504,1555;690,450,999]
min1 = min(A(:));
%[a1,b1,v1] = find(A==min1);确定最小值在第几行第几列
B = A(:);
B(B==min1) = [];
min2 = min(B);
%[a2,b2,v2] = find(A==min2);确定次小值在第几行第几列
fprintf('最小值为 %d \n',[min1]);
%fprintf('最小值为 %d ，在第 %d 行第 %d 列。\n',[min1,a1,b1]);
%fprintf('次小值为 %d ，在第 %d 行第 %d 列。\n',[min2,a2,b2]);
fprintf('次小值为 %d\n',[min2]); 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 




%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
							%G-MS算法，基于最小值和次小值的间距差 
min1 = min(minOfbetaij(:));                     %A=minOfbetaij,min1为矩阵中的最小值
B = minOfbetaij(:);
B(B == min1) = [];                              %矩阵B为矩阵A去掉最小值后的矩阵形式
min2 = min(B);                                  %min2位矩阵B的最小值，即矩阵A的次小值
differ = min2-min1;                             %differ为次小值和最小值的间距
if differ > 3    
    Lrji(i, c1(k)) =prodOfalphaij*minOfbetaij;  %仍按照最小和译码算法计算检验节点
else
     Lrji(i, c1(k)) =prodOfalphaij*minOfbetaij*(log(2)+differ/10);%a=In2=log(2)
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
